package by.nahodkin.tslosika4telegrambot.question;

import org.springframework.stereotype.Component;

@Component
public class Questions {
    static String question1 = "Вопрос 1\n" +
            "1.\tИзбрание председателя правления товарищества собственников жилого дома №4 по улице Маршала Лосика.  \n" +
            "Кандидат – Протасеня А.В.\n";
    static String question2 = "Вопрос 2\n" +
            "Утверждение нового состава правления ТС Лосика 4 в колличестве 5 человек:\n" +
            "1.\tНаходкин Евгений Владимирович;\n" +
            "2.\tМаскаленко Татьяна Петровна;\n" +
            "3.\tШарпе Андрей Валерьевич;\n" +
            "4.\tИванов Михаил Викторович;\n" +
            "5.\tЛойко Сергей Федорович.\n";
    static String question3 = "Вопрос 3\n" +
            "Утверждение нового состава уполномоченных ТС Лосика 4 в колличестве 24 человек:\n" +
            "1.\tГрачева Алеся Адамовна; \n" +
            "2.\tВикторович Вячеслав Викторович;\n" +
            "3.\tКораневская Наталья Александровна;\n" +
            "4.\tКозлов Николай Сергеевич;\n" +
            "5.\tФилиппович Ольга Игоревна;\n" +
            "6.\tКислый Олег Анатольевич;\n" +
            "7.\tГорбач Анна Александровна;\n" +
            "8.\tКоляго Анастасия Евгеньевна;\n" +
            "9.\tСтупчик Ирина Александровна;\n" +
            "10.\tМистейко Михаил Михайлович;\n" +
            "11.\tИгнатчик Александр Анатольевич;\n" +
            "12.\tЖук Светлана Викторовна;\n" +
            "13.\tКончевская Елена Владимировна;\n" +
            "14.\tЯковчик Татьяна Александровна;\n" +
            "15.\tСоловей Анна Ивановна;\n" +
            "16.\tГубкина Елена Васильевна;\n" +
            "17.\tСолтрук Елена Валерьевна;\n" +
            "18.\tЦиндел Наталья Николаевна;\n" +
            "19.\tБурак Руслан Валентинович;\n" +
            "20.\tГизенко Людмила Николаевна;\n" +
            "21.\tТузиков Андрей Николаевич;\n" +
            "22.\tЛагодич Алексей Викторович;\n" +
            "23.\tИванович Екатерина Александровна;\n" +
            "24.\tШуба Михаил Владимирович.\n";

    static String question4 = "Вопрос 4\n" +
            "Передача в республиканскую собственность на безвозмездной основе оборудования АСКУЭ-быт и приборов учета, установленных в жилом доме (поверки, обслуживание и т.д. будет производиться за счет филиала «Энергосбыт», а не за счет собственников и ТС)\n";

    static String question5 = "Вопрос 5\n" +
            "Утвердить в дальнейшем смешанное проведение общего собрания: \n" +
            "- в форме письменного опроса (выдача бюллетеня собственнику под роспись);\n" +
            "- в форме электронного голосования (Telegram Bot с выдачей индивидуального пароля собственнику под роспись);\n" +
            "- в отправки бюллетеня электронным способом с получением уведомления о доставке\n";

    static String question6 = "Вопрос 6\n" +
            "Оплата членских взносов одинаковой суммой для каждого собственника. В случае принятия данного решения величина членского взноса составит 21 рубль с каждого члена товарищества собственников. (На данный момент оплата членских взносов производится пропорционально доли в праве собственности, согласно протоколу собрания №11 от 25.03.2022 г.). В случае принятия внеочередным общим собранием решения об изменении величины членского взноса, его величина будет изменена с 1 октября 2022 года и будет действовать до следующего решения общего собрания членов товарищества собственников касательно установления величины уплачиваемого членского взноса\n";

    static String question7 = "Вопрос 7\n" +
            "Предоставление во временное возмездное пользование (аренду), пространство части фасада дома под размещение рекламных вывесок РУП «Белпочта» и наделить правление товарищества собственников правами в определении стоимости арендной платы\n";

    static String question8 = "Вопрос 8\n" +
            "Вознаграждение действующих членов правления товарищества собственников по итогам работы правления разовой денежной суммой в размере 100 белорусских рублей. Вознаграждение производится при наличии свободных денежных средств\n";

    static String question9 = "Вопрос 9\n" +
            "Разрешить желающим на 1-ом этаже лестничной клетки каждого подъезда установку кронштейнов для велосипедов. Установка производится при наличии свободного места с предварительным согласованием места установки и формы кронштейна с членами правления товарищества собственников за собственный счет, при наличии свободного места. Товарищество собственников не несет ответственность за сохранность велосипедов\n";
}